Repository: zenta-dev/akademove
Catalog: apps/mobile/lib/l10n/arb/app_*.arb
Languages: id

# email_verification_success_description
source: Your email has been verified successfully. You can now sign in to your account.
id: Email Anda telah berhasil diverifikasi. Anda sekarang dapat masuk ke akun Anda.

source: Email verification failed
id: Verifikasi email gagal

# email_verification_invalid_token
source: Invalid or expired verification link. Please request a new one.
id: Link verifikasi tidak valid atau sudah kadaluarsa. Silakan minta yang baru.

source: No Vouchers Available
id: Tidak Ada Voucher

# check_back_later_for_promotions
source: Check back later for promotions and discounts
id: Cek kembali nanti untuk promo dan diskon

# toast_report_submitted
source: Report submitted successfully
id: Laporan berhasil dikirim

# toast_failed_submit_report
source: Failed to submit report
id: Gagal mengirim laporan

source: Report User
id: Laporkan Pengguna

# report_user_description
source: Report an issue with this user
id: Laporkan masalah dengan pengguna ini

# select_report_category
source: Select Issue Category
id: Pilih Kategori Masalah

# report_description
source: Description
id: Deskripsi

# report_description_hint
source: Please describe the issue in detail...
id: Harap jelaskan masalahnya secara detail...

# report_description_helper
source: Minimum 10 characters required
id: Minimal 10 karakter

# report_guidelines_title
source: Reporting Guidelines
id: Panduan Pelaporan

# report_guidelines_content
source: Your report will be kept confidential. The reported user will not be notified of your identity. Our safety team will review all reports within 24-48 hours.
id: Laporan Anda akan dijaga kerahasiaannya. Pengguna yang dilaporkan tidak akan diberitahu tentang identitas Anda. Tim keamanan kami akan meninjau semua laporan dalam 24-48 jam.

# button_submit_report
source: Submit Report
id: Kirim Laporan

# report_category_behavior
source: Inappropriate Behavior
id: Perilaku Tidak Pantas

# report_category_safety
source: Safety Concern
id: Kekhawatiran Keamanan

# report_category_fraud
source: Fraud or Scam
id: Penipuan atau Scam

# report_category_other
source: Other Issue
id: Masalah Lainnya

# report_category_behavior_desc
source: Rude, offensive, or inappropriate conduct during the trip
id: Perilaku kasar, menyinggung, atau tidak pantas selama perjalanan

# report_category_safety_desc
source: Dangerous driving, harassment, or threatening behavior
id: Mengemudi berbahaya, pelecehan, atau perilaku mengancam

# report_category_fraud_desc
source: Payment manipulation, fake profiles, or scam attempts
id: Manipulasi pembayaran, profil palsu, atau percobaan penipuan

# report_category_other_desc
source: Any other issue not covered by the categories above
id: Masalah lain yang tidak tercakup oleh kategori di atas

# no_notifications
source: No notifications yet
id: Belum ada notifikasi

source: Mark all as read
id: Tandai semua sudah dibaca

# notification_time_ago
source: {time} ago
id: {time} yang lalu
