Repository: zenta-dev/akademove
Catalog: apps/mobile/lib/l10n/arb/app_*.arb
Languages: id

# dialog_location_services_disabled_title
source: Location Services Disabled
id: Layanan Lokasi Dinonaktifkan

# dialog_location_services_disabled_message
source: Location services are currently disabled on your device. Please enable them to automatically detect your outlet location.
id: Layanan lokasi saat ini dinonaktifkan di perangkat Anda. Mohon aktifkan untuk mendeteksi lokasi outlet Anda secara otomatis.

# dialog_location_permission_required_title
source: Location Permission Required
id: Izin Lokasi Diperlukan

# dialog_location_permission_required_message
source: Location permission has been permanently denied. To use automatic location detection, please enable it in your app settings. You can still manually set your outlet location by dragging the marker on the map.
id: Izin lokasi telah ditolak secara permanen. Untuk menggunakan deteksi lokasi otomatis, mohon aktifkan di pengaturan aplikasi Anda. Anda masih dapat mengatur lokasi outlet Anda secara manual dengan menyeret penanda di peta.

# label_outlet_location_description
source: Make sure the location point on the map is correct to meet the registration requirements.
id: Pastikan titik lokasi di peta sudah benar untuk memenuhi persyaratan pendaftaran.

# placeholder_search_location
source: Search location
id: Cari lokasi

# label_dragging
source: Dragging...
id: Menyeret...

# toast_location_found
source: Location Found
id: Lokasi Ditemukan

# toast_marker_moved
source: Marker moved to searched location
id: Penanda dipindahkan ke lokasi yang dicari

# toast_not_found
source: Not Found
id: Tidak Ditemukan

# toast_location_not_found
source: Location not found. Please try a different search.
id: Lokasi tidak ditemukan. Silakan coba pencarian lain.

# toast_search_error
source: Search Error
id: Kesalahan Pencarian

# toast_search_error_message
source: Unable to search location. Please check your internet connection.
id: Tidak dapat mencari lokasi. Mohon periksa koneksi internet Anda.

# toast_enter_location
source: Please enter a location to search
id: Mohon masukkan lokasi untuk dicari

# label_benchmark_optional
source: Benchmark (Optional)
id: Patokan (Opsional)

# placeholder_benchmark
source: Next to the Uniqlo store.
id: Samping toko Uniqlo.

# toast_bank_account_verified
source: Bank account verified successfully
id: Rekening bank berhasil diverifikasi

# toast_failed_verify_bank
source: Failed to verify bank account
id: Gagal memverifikasi rekening bank

# toast_enter_bank_account
source: Please enter bank account number
id: Mohon masukkan nomor rekening bank

# toast_bank_account_min_digits
source: Bank account number must be at least 5 digits
id: Nomor rekening bank minimal 5 digit

# toast_select_bank_first
source: Please select a bank provider first
id: Mohon pilih provider bank terlebih dahulu

# label_bank_account_number
source: Bank Account Number
id: Nomor Rekening Bank

# label_account_holder_name
source: Account Holder's Name
id: Nama Pemegang Rekening

# label_owner_bank_name
source: Owner's Name
id: Nama Pemilik

# label_unable_get_address
source: Unable to get address
id: Tidak dapat mendapatkan alamat

# label_step_1
source: Step 1
id: Langkah 1

# label_step_2
source: Step 2
id: Langkah 2

# label_step_3
source: Step 3
id: Langkah 3

# label_outlet_photo_profile
source: Outlet Photo Profile
id: Foto Profil Outlet

# placeholder_outlet_category
source: Pick your outlet category
id: Pilih kategori outlet Anda

# label_outlet_operating_hours
source: Outlet Operating Hours
id: Jam Operasional Outlet

# label_24_hours
source: 24 Hours
id: 24 Jam

# toast_success_set_up
source: Success set up merchant
id: Berhasil mengatur merchant

# toast_complete_required_fields
source: Please complete all required fields
id: Mohon lengkapi semua field yang wajib diisi

# error_outlet_photo_required
source: Outlet photo is required
id: Foto outlet wajib diisi

# error_menu_photo_required
source: Menu photo is required
id: Foto menu wajib diisi

# label_weekly_sales
source: Weekly Sales
id: Penjualan Mingguan

# label_monthly_sales
source: Monthly Sales
id: Penjualan Bulanan

# label_earns
source: Earns
id: Penghasilan

# label_top_ordered_categories
source: Top Ordered Categories
id: Kategori Terlaris

# label_top_ordered_products
source: Top Ordered Products
id: Produk Terlaris

# button_export_pdf
source: Export to PDF
id: Ekspor ke PDF

# category_drinks
source: Drinks
id: Minuman

# category_snack
source: Snack
id: Camilan

# product_fried_chicken
source: Fried Chicken
id: Ayam Goreng

# product_coffee_latte
source: Coffee Latte
id: Kopi Latte

# label_incoming_balance
source: Incoming Balance
id: Saldo Masuk

# label_outgoing_balance
source: Outgoing Balance
id: Saldo Keluar

# label_balance_detail
source: Balance Detail
id: Detail Saldo

# label_gross_sales
source: Gross Sales
id: Penjualan Kotor

# label_platform_commission
source: Platform Commission (20%)
id: Komisi Platform (20%)

# label_net_income
source: Net Income
id: Pendapatan Bersih

# label_nett_income
source: Nett Income
id: Pendapatan Nett

# title_change_password
source: Change Password
id: Ubah Kata Sandi

# placeholder_old_password
source: Enter your old password
id: Masukkan kata sandi lama Anda

# placeholder_new_password
source: Enter your new password
id: Masukkan kata sandi baru Anda

# button_next
source: Next
id: Lanjut

# button_back
source: Back
id: Kembali

# button_save
source: Save
id: Simpan

# label_start
source: Start
id: Mulai

# label_end
source: End
id: Selesai

# day_monday
source: Monday
id: Senin

# day_tuesday
source: Tuesday
id: Selasa

# day_wednesday
source: Wednesday
id: Rabu

# day_thursday
source: Thursday
id: Kamis

# day_friday
source: Friday
id: Jumat

# day_saturday
source: Saturday
id: Sabtu

# day_sunday
source: Sunday
id: Minggu

# toast_success
source: Success
id: Berhasil

# toast_success_set_up_merchant
source: Success set up merchant
id: Berhasil mengatur merchant

# outlet_category_restaurant
source: Restaurant
id: Restoran

# outlet_category_cafe
source: Cafe
id: Kafe

# outlet_category_fast_food
source: Fast Food
id: Makanan Cepat Saji

# outlet_category_bakery
source: Bakery
id: Toko Roti

# outlet_category_street_food
source: Street Food
id: Makanan Jalanan

# outlet_category_coffeeshop
source: Coffee Shop
id: Kedai Kopi

# outlet_category_dessert_shop
source: Dessert Shop
id: Toko Dessert

# outlet_category_juice_bar
source: Juice Bar
id: Kedai Jus

# menu_category_appetizer
source: Appetizer
id: Pembuka

# menu_category_main_course
source: Main Course
id: Hidangan Utama

# menu_category_dessert
source: Dessert
id: Penutup

# menu_category_beverage
source: Beverage
id: Minuman

# menu_category_snack
source: Snack
id: Camilan

# menu_category_breakfast
source: Breakfast
id: Sarapan

# menu_category_lunch
source: Lunch
id: Makan Siang

# menu_category_dinner
source: Dinner
id: Makan Malam

# menu_category_soup
source: Soup
id: Sup

# menu_category_seafood
source: Seafood
id: Makanan Laut

# menu_category_rice
source: Rice
id: Nasi

# menu_category_noodle
source: Noodle
id: Mi

# menu_category_grill
source: Grill
id: Panggang

# title_delivery
source: Delivery
id: Pengiriman

# title_where_you_at
source: Where you at?
id: Di mana Anda?

# title_where_are_you_going
source: Where are you going?
id: Mau ke mana?

# text_choose_pickup_destination
source: Choose your pick-up and destination point!
id: Pilih titik jemput dan tujuan Anda!

# toast_failed_estimate_order
source: Failed to estimate order
id: Gagal menghitung estimasi pesanan

# marker_pickup
source: Pickup
id: Jemput

# marker_dropoff
source: Dropoff
id: Tujuan

# title_order_summary
source: Order Summary
id: Ringkasan Pesanan

# text_no_estimate_available
source: No estimate available
id: Estimasi tidak tersedia

# label_delivery_details
source: Delivery Details
id: Detail Pengiriman

# label_from
source: From
id: Dari

# label_to
source: To
id: Ke

# label_item
source: Item
id: Barang

# label_weight
source: Weight
id: Berat

# label_instructions
source: Instructions
id: Instruksi

# button_apply_coupon
source: Apply Coupon
id: Gunakan Kupon

# text_coupon
source: Coupon
id: Kupon

# label_price_breakdown
source: Price Breakdown
id: Rincian Harga

# label_base_fare
source: Base Fare
id: Tarif Dasar

# label_distance_fare
source: Distance Fare
id: Tarif Jarak

# label_discount
source: Discount
id: Diskon

# title_payment_method
source: Payment Method
id: Metode Pembayaran

# toast_failed_place_order
source: Failed to place order
id: Gagal membuat pesanan

# toast_delivery_order_placed
source: Delivery order placed successfully
id: Pesanan pengiriman berhasil dibuat

# title_ride
source: Ride
id: Tumpangan

# title_trip_details
source: Trip Details
id: Detail Perjalanan

# toast_wallet_payment_failed
source: Wallet payment failed
id: Pembayaran wallet gagal

# title_ride_payment
source: Ride Payment
id: Pembayaran Tumpangan

# text_unsupported_payment_method
source: Unsupported payment method
id: Metode pembayaran tidak didukung

# text_valid_until
source: Valid until
id: Berlaku hingga

# label_confirm_new_password
source: Confirm New Password
id: Konfirmasi Password Baru

# text_rate_this_order
source: Rate this order
id: Beri rating pesanan ini

# button_save_changes
source: Save Changes
id: Simpan Perubahan

# text_thank_you_rating
source: Thank you for your rating!
id: Terima kasih atas penilaian Anda!

# label_achievements
source: Achievements
id: Pencapaian

# text_earned_at
source: Earned at
id: Diperoleh pada

# text_all
source: All
id: Semua

# toast_failed_load_merchants
source: Failed to load merchants
id: Gagal memuat merchant

# text_no_merchants_found
source: No merchants found
id: Merchant tidak ditemukan

# text_try_different_category
source: Try selecting a different category
id: Coba pilih kategori lain

# text_open
source: Open
id: Buka

# text_closed
source: Closed
id: Tutup

# toast_failed_load_mart_data
source: Failed to load mart data
id: Gagal memuat data mart

# label_categories
source: Categories
id: Kategori

# label_recent_orders
source: Recent Orders
id: Pesanan Terbaru

# button_view_all
source: View All
id: Lihat Semua

# label_best_sellers
source: Best Sellers
id: Terlaris

# text_no_rating_yet
source: No rating yet
id: Belum ada rating

# label_nearby_drivers
source: Nearby drivers
id: Driver terdekat

# text_your_current_location
source: Your current location
id: Lokasi Anda saat ini

# item_count
source: {count} item(s)
id: {count} item

# button_accept
source: Accept
id: Terima

source: How was your experience?
id: Bagaimana pengalaman Anda?

source: Mixed
id: Campuran

source: Male
id: Laki-laki

source: Female
id: Perempuan

# toast_app_state_corrupted
source: App state corrupted, please restart
id: State aplikasi rusak, silakan restart

# toast_payment_info_not_available
source: Payment information not available
id: Informasi pembayaran tidak tersedia

# text_apply_coupon
source: Apply Coupon
id: Gunakan Kupon

# text_coupon_applied
source: Coupon: {code}
id: Kupon: {code}

# label_payment_method
source: Payment Method
id: Metode Pembayaran

# label_payment_summary
source: Payment Summary
id: Ringkasan Pembayaran

# text_payment_successful
source: Payment successful
id: Pembayaran berhasil

# text_payment_failed
source: Payment failed
id: Pembayaran gagal

# text_unsupported_payment_method_description
source: The selected payment method is not supported. Please choose a different method.
id: Metode pembayaran yang dipilih tidak didukung. Silakan pilih metode lain.

# toast_va_number_not_available
source: VA Number is not available
id: Nomor VA tidak tersedia

# toast_va_number_copied
source: VA Number copied to clipboard
id: Nomor VA disalin ke clipboard

# text_provider_label
source: Provider :
id: Penyedia :

# text_va_number_label
source: VA Number :
id: Nomor VA :

# text_valid_until_with_date
source: Valid until {date}
id: Berlaku hingga {date}

# text_on_trip
source: On Trip
id: Dalam Perjalanan

# text_license_plate
source: License plate
id: Plat nomor

# text_finding_driver
source: Finding your driver...
id: Mencari driver Anda...

# text_finding_driver_message
source: Please wait while we match you with a driver
id: Mohon tunggu sementara kami mencarikan driver untuk Anda

# status_searching
source: Searching
id: Mencari

# status_driver_found
source: Driver found
id: Driver ditemukan

# status_on_the_way
source: On the way
id: Dalam perjalanan

# text_pickup_location
source: Pickup location
id: Lokasi penjemputan

# text_dropoff_location
source: Dropoff location
id: Lokasi tujuan

# label_payment_method_lower
source: Payment Method
id: Metode Pembayaran

# label_total_price
source: Total Price
id: Total Harga

# text_order_details
source: Order Details
id: Detail Pesanan

# text_finding_driver_title
source: Finding driver
id: Mencari driver

# text_your_driver_title
source: Your driver
id: Driver Anda

# text_trip_completed
source: Trip completed!
id: Perjalanan selesai!

# text_trip_canceled
source: Trip was canceled
id: Perjalanan dibatalkan

# title_delivery_details
source: Delivery Details
id: Detail Pengiriman

# label_item_description
source: Item Description
id: Deskripsi Barang

# placeholder_item_description
source: What are you sending?
id: Apa yang akan Anda kirim?

# label_weight_kg
source: Weight (kg)
id: Berat (kg)

# placeholder_weight_kg
source: Enter weight in kg (max 20kg)
id: Masukkan berat dalam kg (maks 20kg)

# text_maximum_weight
source: Maximum weight: 20kg
id: Berat maksimum: 20kg

# text_special_handling_instructions
source: Add any special handling or delivery instructions
id: Tambahkan instruksi penanganan atau pengiriman khusus

# label_item_photos_optional
source: Item Photos (Optional)
id: Foto Barang (Opsional)

# text_add_up_to_3_photos
source: Add up to 3 photos of the item
id: Tambahkan hingga 3 foto barang

# toast_provide_item_description
source: Please provide item description
id: Harap berikan deskripsi barang

# toast_weight_must_be_valid
source: Weight must be between 0.1kg and 20kg
id: Berat harus antara 0,1kg dan 20kg

# text_thank_you_for_review
source: Thank you for your review!
id: Terima kasih atas ulasan Anda!

# toast_failed_submit_review
source: Failed to submit review
id: Gagal mengirim ulasan

# text_rate_by_category
source: Rate by category
id: Beri nilai berdasarkan kategori

# category_cleanliness
source: Cleanliness
id: Kebersihan

# category_courtesy
source: Courtesy
id: Kesopanan

# category_punctuality
source: Punctuality
id: Ketepatan Waktu

# category_safety
source: Safety
id: Keamanan

# category_communication
source: Communication
id: Komunikasi

# category_overall
source: Overall
id: Keseluruhan

# category_desc_cleanliness
source: How clean was the vehicle and the driver's appearance?
id: Seberapa bersih kendaraan dan penampilan driver?

# category_desc_courtesy
source: How polite and respectful was the driver?
id: Seberapa sopan dan hormat driver?

# category_desc_punctuality
source: Was the driver on time for pickup?
id: Apakah driver tepat waktu untuk penjemputan?

# category_desc_safety
source: Did you feel safe during the trip?
id: Apakah Anda merasa aman selama perjalanan?

# category_desc_communication
source: How well did the driver communicate?
id: Seberapa baik driver berkomunikasi?

# category_desc_overall
source: Rate your overall experience with this driver
id: Beri nilai pengalaman Anda secara keseluruhan dengan driver ini

# rating_poor
source: Poor
id: Buruk

# rating_below_average
source: Below Average
id: Di Bawah Rata-rata

# rating_average
source: Average
id: Rata-rata

# rating_good
source: Good
id: Baik

# rating_excellent
source: Excellent
id: Sangat Baik

# label_additional_comments
source: Additional comments (optional)
id: Komentar tambahan (opsional)

# placeholder_additional_comments
source: Tell us more about your experience...
id: Ceritakan lebih banyak tentang pengalaman Anda...

# button_submit_review
source: Submit Review
id: Kirim Ulasan

# toast_please_rate_category
source: Please rate {category}
id: Harap beri nilai {category}

# text_drivers_around_you
source: There are {count} drivers around you
id: Ada {count} driver di sekitar Anda

# text_no_order_history
source: No order history found
id: Tidak ada riwayat pesanan

# text_order_id_short
source: Order #{id}
id: Pesanan #{id}

# label_notes
source: Notes
id: Catatan

# text_unknown_user
source: Unknown User
id: Pengguna Tidak Dikenal

# text_customer
source: Customer
id: Pelanggan

# button_call_customer
source: Call Customer
id: Hubungi Pelanggan

# button_delete
source: Delete
id: Hapus

# title_edit_schedule
source: Edit Schedule
id: Edit Jadwal

# title_add_schedule
source: Add Schedule
id: Tambah Jadwal

# placeholder_course_name
source: e.g., Mobile Programming
id: contoh: Pemrograman Mobile

# button_cancel
source: Cancel
id: Batal

# text_failed_to_load_profile
source: Failed to load profile: {error}
id: Gagal memuat profil: {error}

# text_no_rankings_yet
source: No rankings yet
id: Belum ada peringkat

# title_where_going
source: Where are you going?
id: Mau ke mana?

# tab_rankings
source: Rankings
id: Peringkat

# tab_badges
source: Badges
id: Lencana

# text_user_id
source: User {id}
id: Pengguna {id}

# text_category_value
source: Category: {category}
id: Kategori: {category}

# text_period_value
source: Period: {period}
id: Periode: {period}

# text_earned
source: Earned
id: Diperoleh

# text_balance_with_amount
source: Balance: {amount}
id: Saldo: {amount}

# button_top_up
source: Top Up
id: Isi Saldo

# text_select_via_map
source: Select via map
id: Pilih via peta

# text_no_place_found
source: No place found
id: Tidak ada tempat ditemukan

# title_location_permission_required
source: Location Permission Required
id: Izin Lokasi Diperlukan

# text_location_permission_denied
source: Location permission was previously denied. To go online and accept orders, you need to enable location access in your device settings.
id: Izin lokasi sebelumnya ditolak. Untuk online dan menerima pesanan, Anda perlu mengaktifkan akses lokasi di pengaturan perangkat.

# text_location_permission_request
source: To accept ride and delivery orders, drivers must share their location in real-time. This helps:
id: Untuk menerima pesanan ride dan delivery, driver harus membagikan lokasi mereka secara real-time. Ini membantu:

# text_location_benefit_match_orders
source: Match you with nearby orders
id: Mencocokkan Anda dengan pesanan terdekat

# text_location_benefit_track_arrival
source: Let customers track your arrival
id: Biarkan pelanggan melacak kedatangan Anda

# text_location_benefit_safety
source: Ensure safety and accountability
id: Memastikan keamanan dan akuntabilitas

# text_location_redirect_settings
source: You will be redirected to app settings to enable location access.
id: Anda akan diarahkan ke pengaturan aplikasi untuk mengaktifkan akses lokasi.

# button_open_settings
source: Open Settings
id: Buka Pengaturan

# button_grant_permission
source: Grant Permission
id: Berikan Izin

# title_rate_customer
source: Rate Customer
id: Beri Rating Pelanggan

# text_experience_with_user
source: How was your experience with {name}?
id: Bagaimana pengalaman Anda dengan {name}?

# category_other
source: Other
id: Lainnya

# toast_review_submitted
source: Review submitted successfully
id: Ulasan berhasil dikirim

# toast_review_failed
source: Failed to submit review
id: Gagal mengirim ulasan

# title_reject_order
source: Reject Order
id: Tolak Pesanan

# text_select_rejection_reason
source: Please select a reason for rejecting this order:
id: Silakan pilih alasan penolakan pesanan ini:

# rejection_reason_out_of_stock
source: Out of Stock
id: Stok Habis

# rejection_reason_too_busy
source: Too Busy / High Order Volume
id: Terlalu Sibuk / Volume Pesanan Tinggi

# rejection_reason_ingredient_unavailable
source: Ingredient Unavailable
id: Bahan Tidak Tersedia

# rejection_reason_closed
source: Store Closed / Closing Soon
id: Toko Tutup / Akan Tutup

# rejection_reason_other
source: Other
id: Lainnya

# label_additional_note_optional
source: Additional Note (Optional)
id: Catatan Tambahan (Opsional)

# placeholder_rejection_note
source: e.g., "We ran out of chicken, will restock tomorrow"
id: contoh: "Ayam habis, akan restok besok"

# button_reject_order
source: Reject Order
id: Tolak Pesanan

source: My Reviews
id: Ulasan Saya

source: Failed to load
id: Gagal memuat

source: No reviews yet
id: Belum ada ulasan

source: Punctuality
id: Ketepatan Waktu

source: Safety
id: Keamanan

source: Communication
id: Komunikasi

source: Delete Account
id: Hapus Akun

# delete_account_title
source: Delete Account?
id: Hapus Akun?

# delete_account_warning
source: This action is permanent and cannot be undone.
id: Tindakan ini permanen dan tidak dapat dibatalkan.

# delete_account_you_will_lose
source: You will lose:
id: Anda akan kehilangan:

# delete_account_lose_wallet
source: All wallet balance
id: Semua saldo dompet

# delete_account_lose_history
source: Order history
id: Riwayat pesanan

# delete_account_lose_ratings
source: Ratings and reviews
id: Rating dan ulasan

# delete_account_lose_addresses
source: Saved addresses
id: Alamat tersimpan

# delete_account_lose_data
source: All account data
id: Semua data akun

# delete_account_proceed_methods
source: To proceed, please use one of the following methods:
id: Untuk melanjutkan, silakan gunakan salah satu metode berikut:

# continue_text
source: Continue
id: Lanjutkan

# delete_account_choose_method
source: Choose Deletion Method
id: Pilih Metode Penghapusan

# delete_account_select_method
source: Select how you want to request account deletion:
id: Pilih cara Anda ingin meminta penghapusan akun:

# delete_account_method_web
source: Online Form (Recommended)
id: Formulir Online (Rekomendasi)

# delete_account_method_web_desc
source: Complete form on our website
id: Lengkapi formulir di website kami

# delete_account_method_email
source: Email Request
id: Permintaan Email

# delete_account_method_email_desc
source: Send request via email
id: Kirim permintaan melalui email

# delete_account_method_whatsapp
source: WhatsApp Support
id: Dukungan WhatsApp

# delete_account_method_whatsapp_desc
source: Chat with support team
id: Chat dengan tim dukungan

# delete_account_error_open_web
source: Could not open web page. Please try again.
id: Tidak dapat membuka halaman web. Silakan coba lagi.

# delete_account_error_open_email
source: Could not open email app. Please try again.
id: Tidak dapat membuka aplikasi email. Silakan coba lagi.

# delete_account_error_open_whatsapp
source: Could not open WhatsApp. Please try again.
id: Tidak dapat membuka WhatsApp. Silakan coba lagi.

# email_verification_title
source: Verify Your Email
id: Verifikasi Email Anda

# email_verification_description
source: We've sent a verification link to your email address.
id: Kami telah mengirim link verifikasi ke alamat email Anda.

# email_verification_sent
source: Verification email sent successfully!
id: Email verifikasi berhasil dikirim!

# email_verification_instruction
source: Click the link in the email to verify your account. If you don't see the email, check your spam folder.
id: Klik link di email untuk memverifikasi akun Anda. Jika tidak melihat emailnya, periksa folder spam.

# email_verification_resend
source: Resend Verification Email
id: Kirim Ulang Email Verifikasi

# email_verification_resend_countdown
source: Resend in {seconds}s
id: Kirim ulang dalam {seconds} detik

# email_verification_spam_hint
source: Don't forget to check your spam folder!
id: Jangan lupa periksa folder spam Anda!

# email_verification_success_title
source: Email Verified!
id: Email Terverifikasi!
