Repository: zenta-dev/akademove
Catalog: apps/mobile/lib/l10n/arb/app_*.arb
Languages: id

# message_rate_experience
source: How was your experience with {name}?
id: Bagaimana pengalaman Anda dengan {name}?

# message_confirmation
source: This will send an emergency alert to campus authorities and notify emergency contacts. Are you sure you want to continue?
id: Ini akan mengirim peringatan darurat ke otoritas kampus dan memberi tahu kontak darurat. Apakah Anda yakin ingin melanjutkan?

# message_settings_coming_soon
source: Settings feature coming soon
id: Fitur pengaturan akan segera hadir

# message_failed_load_profile
source: Failed to load profile:
id: Gagal memuat profil:

# message_failed_update_menu
source: Failed to update menu
id: Gagal memperbarui menu

# message_failed_verify_bank
source: Failed to verify bank account
id: Gagal memverifikasi rekening bank

# message_confirm_reject_order
source: Are you sure you want to reject this order? This action cannot be undone.
id: Apakah Anda yakin ingin menolak pesanan ini? Tindakan ini tidak dapat dibatalkan.

# message_confirm_cancel_order
source: Are you sure you want to cancel this order? The customer will be notified.
id: Apakah Anda yakin ingin membatalkan pesanan ini? Pelanggan akan diberitahu.

# message_confirm_delete_schedule
source: Are you sure you want to delete "{name}"? This action cannot be undone.
id: Apakah Anda yakin ingin menghapus "{name}"? Tindakan ini tidak dapat dibatalkan.

# message_confirm_logout
source: Are you sure you want to logout?
id: Apakah Anda yakin ingin keluar?

# message_confirm_accept_order
source: Are you sure you want to accept this order?
id: Apakah Anda yakin ingin menerima pesanan ini?

# message_confirm_delete_menu
source: Are you sure want to delete this menu?
id: Apakah Anda yakin ingin menghapus menu ini?

# message_select_reject_reason
source: Please select a reason for rejecting this order:
id: Mohon pilih alasan untuk menolak pesanan ini:

# dragging_marker
source: Dragging...
id: Menggeser...

source: Welcome back!
id: Selamat datang kembali!

source: Driver Status
id: Status Driver

# accepting_orders
source: You are accepting orders
id: Anda menerima pesanan

# offline
source: You are offline
id: Anda offline

# ready_accept
source: Ready to accept new orders
id: Siap menerima pesanan baru

# toggle_receive
source: Toggle on to start receiving orders
id: Aktifkan untuk mulai menerima pesanan

# today_performance
source: Today's Performance
id: Performa Hari Ini

source: Quick Actions
id: Aksi Cepat

source: Open Today
id: Buka Hari Ini

source: Sales Recap
id: Rekap Penjualan

# today_transaction
source: Today's transaction
id: Transaksi hari ini

# today_gross_sales
source: Today's gross sales
id: Penjualan kotor hari ini

source: See detail
id: Lihat detail

# send_packages
source: Send packages within campus
id: Kirim paket di dalam kampus

# max_weight
source: Max weight: 20kg
id: Maks berat: 20kg

source: Fast delivery
id: Pengiriman cepat

source: Secure handling
id: Penanganan aman

source: Start Delivery
id: Mulai Pengiriman

# choose_pickup_destination
source: Choose your pick-up and destination point!
id: Pilih titik penjemputan dan tujuan Anda!

# action_take_photo
source: Take a photo
id: Ambil foto

# action_choose_gallery
source: Choose from gallery
id: Pilih dari galeri

# action_remove_image
source: Remove image
id: Hapus gambar

source: Enter withdrawal amount
id: Masukkan jumlah penarikan

# cart_shopping_cart
source: Shopping Cart
id: Keranjang Belanja

# cart_your_cart_is_empty
source: Your cart is empty
id: Keranjang Anda kosong

# cart_add_items_to_see_here
source: Add items from AMart to see them here
id: Tambahkan item dari AMart untuk melihatnya di sini

# cart_browse_amart
source: Browse AMart
id: Jelajahi AMart

# cart_total_items
source: Total ({count} items)
id: Total ({count} item)

# cart_coming_soon
source: Coming Soon
id: Segera Hadir

# cart_order_confirmation_coming_soon
source: Order confirmation screen coming soon
id: Layar konfirmasi pesanan segera hadir

# cart_clear_cart
source: Clear Cart?
id: Kosongkan Keranjang?

# cart_clear_cart_confirmation
source: Are you sure you want to remove all items from your cart?
id: Apakah Anda yakin ingin menghapus semua item dari keranjang Anda?

# cart_clear
source: Clear
id: Kosongkan

# cart_failed_to_load
source: Failed to load cart
id: Gagal memuat keranjang

# cart_note_prefix
source: Note:
id: Catatan:

# cart_replace_cart_items
source: Replace Cart Items?
id: Ganti Item Keranjang?

# cart_contains_items_from
source: Your cart contains items from {merchantName}.
id: Keranjang Anda berisi item dari {merchantName}.

# cart_discard_and_add_from
source: Do you want to discard those items and add items from {merchantName} instead?
id: Apakah Anda ingin membuang item tersebut dan menambahkan item dari {merchantName}?

# cart_current_cart_will_be_cleared
source: Your current cart will be cleared
id: Keranjang Anda saat ini akan dikosongkan

# cart_replace_cart
source: Replace Cart
id: Ganti Keranjang

source: Menu Details
id: Detail Menu

# menu_in_stock
source: In Stock ({count} available)
id: Tersedia ({count} stok)

# menu_out_of_stock
source: Out of Stock
id: Stok Habis

# menu_quantity
source: Quantity
id: Jumlah

# menu_special_notes_optional
source: Special Notes (Optional)
id: Catatan Khusus (Opsional)

# menu_total_price
source: Total Price
id: Total Harga

# menu_add_to_cart
source: Add to Cart
id: Tambah ke Keranjang

# menu_added_to_cart
source: Added to Cart
id: Ditambahkan ke Keranjang

# menu_item_added_to_cart
source: Item has been added to your cart
id: Item telah ditambahkan ke keranjang Anda

# order_confirm_title
source: Confirm Order
id: Konfirmasi Pesanan

# order_confirm_order_summary
source: Order Summary
id: Ringkasan Pesanan

# order_confirm_items_count
source: {count} item(s)
id: {count} item

# order_confirm_payment_method
source: Payment Method
id: Metode Pembayaran

# order_confirm_select_payment
source: Select payment method
id: Pilih metode pembayaran

# order_confirm_payment_wallet
source: wallet
id: Dompet

# order_confirm_payment_description
source: Pay using your Akademove wallet balance
id: Bayar menggunakan saldo dompet Akademove Anda

# order_confirm_place_order
source: Place Order
id: Buat Pesanan

# order_confirm_success
source: Order Placed Successfully
id: Pesanan Berhasil Dibuat

# order_confirm_success_message
source: Your order has been placed and is being processed
id: Pesanan Anda telah dibuat dan sedang diproses

# order_confirm_failed
source: Failed to Place Order
id: Gagal Membuat Pesanan

# order_confirm_processing
source: Processing Order...
id: Memproses Pesanan...

# order_confirm_insufficient_balance
source: Insufficient wallet balance
id: Saldo dompet tidak mencukupi

source: Rate Your Experience
id: Beri Rating Pengalaman Anda

source: Overall Rating
id: Rating Keseluruhan

# cleanliness_rating
source: Cleanliness
id: Kebersihan

# courtesy_rating
source: Courtesy
id: Kesopanan

# other_rating
source: Other
id: Lainnya

source: Add Comment (Optional)
id: Tambahkan Komentar (Opsional)

source: Submit Review
id: Kirim Ulasan

source: Review submitted successfully
id: Ulasan berhasil dikirim

# review_submission_failed
source: Failed to submit review
id: Gagal mengirim ulasan

# you_already_reviewed_order
source: You already reviewed this order
id: Anda sudah memberi ulasan untuk pesanan ini

source: Order must be completed first
id: Pesanan harus diselesaikan terlebih dahulu

# rating_required
source: Please provide a rating
id: Mohon berikan rating

# coupon_no_coupons_available
source: No coupons available
id: Tidak ada kupon tersedia

# coupon_select_coupon
source: Select Coupon
id: Pilih Kupon

# coupon_remove_coupon
source: Remove Coupon
id: Hapus Kupon

# payment_method_wallet
source: Wallet
id: Dompet

# payment_method_bank_transfer
source: Bank Transfer
id: Transfer Bank

source: Emergency alert sent successfully
id: Peringatan darurat berhasil dikirim

# emergency_alert_title
source: Emergency Alert
id: Peringatan Darurat

# emergency_report_title
source: Report Emergency
id: Laporkan Darurat

# emergency_select_type
source: Select emergency type:
id: Pilih jenis darurat:

# emergency_describe_situation
source: Describe the emergency situation...
id: Jelaskan situasi darurat...

# emergency_send_alert
source: Send Alert
id: Kirim Peringatan

# button_continue
source: Continue
id: Lanjutkan

# leaderboard_no_rankings
source: No rankings yet
id: Belum ada peringkat

# leaderboard_no_badges
source: No badges available
id: Tidak ada lencana tersedia

# leaderboard_pts
source: pts
id: poin

# chat_no_messages
source: No messages yet
id: Belum ada pesan

# merchant_order_accept
source: Accept
id: Terima

# gender_label
source: Gender:
id: Jenis Kelamin:

source: Top Up QRIS
id: Isi Ulang QRIS

source: Rate Your Driver
id: Beri Rating Driver Anda

# dialog_location_permission
source: Location Permission
id: Izin Lokasi

# dialog_location_services_disabled
source: Location Services Disabled
id: Layanan Lokasi Dinonaktifkan

# dialog_location_permission_required
source: Location Permission Required
id: Izin Lokasi Diperlukan

# drag_to_adjust
source: Drag to adjust position
id: Geser untuk mengatur posisi

# error_enter_location_to_search
source: Please enter a location to search
id: Mohon masukkan lokasi untuk dicari

# success_signed_up
source: Successfully signed up
id: Pendaftaran berhasil

# error_fill_all_required_fields
source: Please fill all required fields correctly
id: Mohon isi semua kolom yang diperlukan dengan benar

# error_complete_all_required_fields
source: Please complete all required fields
id: Mohon lengkapi semua kolom yang wajib diisi

# error_passwords_not_match
source: Passwords do not match
id: Kata sandi tidak cocok

# merchant_step_1_description
source: Tell us about yourself to kickstart your merchant journey!
id: Ceritakan tentang diri Anda untuk memulai perjalanan mitra!

# merchant_step_2_description
source: Share your outlet details and location so customers can find you easily!
id: Bagikan detail dan lokasi outlet agar pelanggan mudah menemukan Anda!

# merchant_step_3_description
source: Add your bank account to receive payments securely!
id: Tambahkan rekening bank untuk menerima pembayaran dengan aman!

# placeholder_outlet_name
source: Enter outlet name
id: Masukkan nama outlet

# label_outlet_location
source: Outlet's Location
id: Lokasi Outlet

# label_bank_provider
source: Bank Provider
id: Bank

# label_outlet_category
source: Outlet Category
id: Kategori Outlet

# helper_outlet_category_select
source: Select the main category for your outlet
id: Pilih kategori utama untuk outlet Anda

# placeholder_select_outlet_category
source: Select outlet category
id: Pilih kategori outlet

# label_phone
source: Phone
id: Telepon

# dialog_accept_order
source: Accept Order
id: Terima Pesanan

# dialog_accept_order_confirm
source: Are you sure you want to accept this order?
id: Apakah Anda yakin ingin menerima pesanan ini?

# toast_validation_error
source: Validation Error
id: Kesalahan Validasi

# error_menu_name_required
source: Menu name is required
id: Nama menu wajib diisi

# error_menu_price_required
source: Menu price is required
id: Harga menu wajib diisi

# error_valid_price_required
source: Please enter a valid price
id: Mohon masukkan harga yang valid

# error_merchant_info_not_found
source: Merchant information not found
id: Informasi merchant tidak ditemukan

# success_menu_created
source: Menu created successfully
id: Menu berhasil dibuat

# error_failed_create_menu
source: Failed to create menu
id: Gagal membuat menu

# title_create_menu
source: Create Menu
id: Buat Menu

# error_menu_info_not_found
source: Menu information not found
id: Informasi menu tidak ditemukan

# error_menu_not_found
source: Menu not found
id: Menu tidak ditemukan

# placeholder_search_menu
source: Search menu...
id: Cari menu...

# title_menu_detail
source: Menu Detail
id: Detail Menu

# dialog_delete_menu
source: Delete Menu
id: Hapus Menu

# dialog_delete_menu_confirm
source: Are you sure you want to delete "{name}"?
id: Apakah Anda yakin ingin menghapus "{name}"?

# success_menu_deleted
source: Menu deleted successfully
id: Menu berhasil dihapus

# error_failed_delete_menu
source: Failed to delete menu
id: Gagal menghapus menu

# label_old_password
source: Old Password
id: Kata Sandi Lama

# placeholder_enter_old_password
source: Enter your old password
id: Masukkan kata sandi lama Anda

# label_new_password
source: New Password
id: Kata Sandi Baru

# placeholder_enter_new_password
source: Enter your new password
id: Masukkan kata sandi baru Anda

# label_confirm_password
source: Confirm Password
id: Konfirmasi Kata Sandi

# placeholder_confirm_new_password
source: Confirm your new password
id: Konfirmasi kata sandi baru Anda

# error_failed_verify_bank
source: Failed to verify bank account
id: Gagal memverifikasi rekening bank

source: Loading map...
id: Memuat peta...

source: Success set up merchant
id: Berhasil menyiapkan merchant

# title_set_up_outlet
source: Set Up Outlet
id: Atur Outlet

# title_sales_report
source: Sales Report
id: Laporan Penjualan

# tab_weekly_sales
source: Weekly Sales
id: Penjualan Mingguan

# tab_monthly_sales
source: Monthly Sales
id: Penjualan Bulanan

# title_commission_report
source: Commission Report
id: Laporan Komisi

# title_order_detail
source: Order Detail
id: Detail Pesanan

# button_add_schedule
source: Add Schedule
id: Tambah Jadwal

# placeholder_class_name
source: e.g., Mobile Programming
id: mis., Pemrograman Mobile

# dialog_call_customer
source: Call Customer
id: Telepon Pelanggan

# section_today_performance
source: Today's Performance
id: Performa Hari Ini

# section_quick_actions
source: Quick Actions
id: Aksi Cepat

# dialog_rate_customer
source: Rate Customer
id: Beri Rating Pelanggan

# label_review_category
source: Review Category
id: Kategori Ulasan

# label_comment_optional
source: Comment (Optional)
id: Komentar (Opsional)

# placeholder_share_experience
source: Share your experience...
id: Bagikan pengalaman Anda...

# button_submit
source: Submit
id: Kirim

# dialog_new_order
source: New {type} Order
id: Pesanan {type} Baru

# label_order_id_prefix
source: Order #
id: Pesanan #

# label_pickup
source: Pickup
id: Penjemputan

# label_dropoff
source: Dropoff
id: Tujuan

# label_distance
source: Distance
id: Jarak

# label_earnings
source: Earnings
id: Penghasilan

# label_gender_preference
source: Gender preference: {gender}
id: Preferensi gender: {gender}

# label_note
source: Note:
id: Catatan:

# label_pickup_prefix
source: Pickup: {location}
id: Penjemputan: {location}

# label_dropoff_prefix
source: Dropoff: {location}
id: Tujuan: {location}

# label_instructions_prefix
source: Instructions: {instructions}
id: Instruksi: {instructions}

# order_type_ride_label
source: Ride
id: Perjalanan

# order_type_delivery_label
source: Delivery
id: Pengiriman

# order_type_food_label
source: Food
id: Makanan

# toast_order_unavailable
source: Order Unavailable
id: Pesanan Tidak Tersedia

# toast_order_unavailable_message
source: This order was cancelled or accepted by another driver
id: Pesanan ini dibatalkan atau diterima oleh driver lain

# toast_order_rejected
source: Order Rejected
id: Pesanan Ditolak

# toast_order_rejected_message
source: You rejected the order
id: Anda menolak pesanan

# label_total_fare
source: Total Fare
id: Total Biaya

# dialog_unsupported_payment
source: Unsupported payment method
id: Metode pembayaran tidak didukung

# dialog_unsupported_payment_message
source: The selected payment method is not supported. Please choose a different method.
id: Metode pembayaran yang dipilih tidak didukung. Silakan pilih metode lain.

# label_provider
source: Provider :
id: Penyedia :

# label_va_number
source: VA Number :
id: Nomor VA :

# label_valid_until
source: Valid until {date}
id: Berlaku sampai {date}

# label_remaining_time
source: Remaining Time :
id: Waktu Tersisa :

# button_copy_va_number
source: Copy VA Number
id: Salin Nomor VA

# label_no_rating_yet
source: No rating yet
id: Belum ada rating

# message_wait_for_driver
source: Please wait while we match you with a driver
id: Mohon tunggu sementara kami mencocokkan Anda dengan driver

# label_license_plate
source: License plate
id: Plat nomor

# status_finding_driver
source: Finding driver
id: Mencari driver

# status_your_driver
source: Your driver
id: Driver Anda

# instruction_choose_pickup_destination
source: Choose your pick-up and destination point!
id: Pilih titik penjemputan dan tujuan Anda!

# button_proceed
source: Proceed
id: Lanjutkan

# placeholder_what_sending
source: What are you sending?
id: Apa yang Anda kirim?

# placeholder_enter_weight
source: Enter weight in kg (max 20kg)
id: Masukkan berat dalam kg (maks 20kg)

# helper_special_instructions
source: Add any special handling or delivery instructions
id: Tambahkan instruksi penanganan atau pengiriman khusus

# helper_add_photos
source: Add up to 3 photos of the item
id: Tambahkan hingga 3 foto item

# error_provide_item_description
source: Please provide item description
id: Mohon berikan deskripsi item

# error_no_estimate_available
source: No estimate available
id: Tidak ada perkiraan tersedia

# button_choose_payment_method
source: Choose Payment Method
id: Pilih Metode Pembayaran

# button_place_order
source: Place Order
id: Buat Pesanan

# label_photo_profile
source: Photo Profile
id: Foto Profil

# label_name
source: Name
id: Nama

# section_achievements
source: Achievements
id: Pencapaian

# button_rate_this_order
source: Rate this order
id: Beri rating pesanan ini

# empty_no_order_history
source: No order history found
id: Tidak ada riwayat pesanan

# label_your_current_location
source: Your current location
id: Lokasi Anda saat ini

# label_drivers_around
source: There are {count} drivers around you
id: Ada {count} driver di sekitar Anda

# error_failed_load_mart
source: Failed to load mart data
id: Gagal memuat data mart

# error_failed_load_merchants
source: Failed to load merchants
id: Gagal memuat merchant

# empty_no_merchants_found
source: No merchants found
id: Tidak ada merchant ditemukan

# button_select_via_map
source: Select via map
id: Pilih melalui peta

# error_no_place_found
source: No place found
id: Tidak ada tempat ditemukan

# title_select_bank_provider
source: Select Bank Provider
id: Pilih Bank

# button_download_qr
source: Download QR
id: Unduh QR

# button_copy_qr_url
source: Copy QR URL
id: Salin URL QR

# placeholder_type_message
source: Type a message...
id: Ketik pesan...

# tab_on_process
source: On process
id: Dalam proses

# tab_completed
source: Completed
id: Selesai

# tab_canceled
source: Canceled
id: Dibatalkan

source: Start Preparing
id: Mulai Siapkan

source: Order Ready
id: Pesanan Siap

# waiting_for_driver_pickup
source: Waiting for driver to pickup...
id: Menunggu driver untuk mengambil...

# no_menu_items_yet
source: No menu items yet. Tap + to add your first item.
id: Belum ada menu. Ketuk + untuk menambahkan menu pertama Anda.

# no_menu_items_found
source: No menu items found for "{query}"
id: Tidak ada menu ditemukan untuk "{query}"

# placeholder_search_menu_hint
source: Search menu...
id: Cari menu...

# label_menu_name
source: Menu Name
id: Nama Menu

# label_menu_price
source: Menu Price
id: Harga Menu

# label_menu_stock
source: Menu Stock
id: Stok Menu

# label_menu_category
source: Menu Category
id: Kategori Menu

# label_menu_photo
source: Menu Photo
id: Foto Menu

# placeholder_menu_name
source: Enter menu name
id: Masukkan nama menu

# placeholder_menu_price
source: Enter price
id: Masukkan harga

# label_category
source: Category
id: Kategori

# label_price
source: Price
id: Harga

# label_stock
source: Stock
id: Stok

# label_created
source: Created
id: Dibuat

# label_updated
source: Updated
id: Diperbarui

# placeholder_select_category
source: Select category
id: Pilih kategori

# error_validation
source: Validation Error
id: Kesalahan Validasi

# title_privacy_policies
source: Privacy Policies
id: Kebijakan Privasi

source: Ordered by
id: Dipesan oleh

source: Driver assigned
id: Driver ditugaskan

source: Order Items
id: Item Pesanan

source: Base Price
id: Harga Dasar

source: Order Time
id: Waktu Pesanan

source: Order Chat
id: Chat Pesanan

# toast_order_accepted
source: Order accepted successfully
id: Pesanan berhasil diterima

# toast_order_rejected_success
source: Order rejected successfully
id: Pesanan berhasil ditolak

# toast_order_marked_preparing
source: Order marked as preparing
id: Pesanan ditandai sedang disiapkan

# toast_order_marked_ready
source: Order marked as ready for pickup
id: Pesanan ditandai siap diambil

# toast_failed_accept_order
source: Failed to accept order
id: Gagal menerima pesanan

# toast_failed_reject_order
source: Failed to reject order
id: Gagal menolak pesanan

# toast_failed_update_order
source: Failed to update order
id: Gagal memperbarui pesanan

# toast_merchant_id_not_found
source: Merchant ID not found
id: ID Merchant tidak ditemukan

source: Unknown Item
id: Item Tidak Diketahui

# error_valid_price
source: Please enter a valid price
id: Mohon masukkan harga yang valid

# toast_menu_created_success
source: Menu created successfully
id: Menu berhasil dibuat

# toast_failed_create_menu
source: Failed to create menu
id: Gagal membuat menu

# toast_menu_updated_success
source: Menu updated successfully
id: Menu berhasil diperbarui

# toast_failed_update_menu
source: Failed to update menu
id: Gagal memperbarui menu

# button_create_menu
source: Create Menu
id: Buat Menu

# button_create
source: Create
id: Buat

# label_menu_description
source: Menu Description
id: Deskripsi Menu

# placeholder_menu_description
source: Combined coffee and brown sugar
id: Kopi dengan gula merah

# placeholder_menu_category
source: Drink
id: Minuman

# label_menu_photo_optional
source: Menu Photo (Optional)
id: Foto Menu (Opsional)

# title_edit_profile
source: Edit Profile
id: Edit Profil

# label_owner_name
source: Owner's Name
id: Nama Pemilik

# placeholder_owner_name
source: Enter owner name
id: Masukkan nama pemilik

# label_owner_email
source: Owner's Email
id: Email Pemilik

# placeholder_owner_email
source: Enter owner email
id: Masukkan email pemilik

# label_owner_phone
source: Owner's Phone Number
id: Nomor Telepon Pemilik

# label_outlet_name
source: Outlet's Name
id: Nama Outlet

# label_outlet_phone
source: Outlet's Phone Number
id: Nomor Telepon Outlet

# label_outlet_email
source: Outlet's Email
id: Email Outlet

# placeholder_outlet_email
source: Enter outlet email
id: Masukkan email outlet

# label_outlet_document
source: Outlet's Document (Optional)
id: Dokumen Outlet (Opsional)

# label_choose_bank
source: Choose bank
id: Pilih bank

# placeholder_select_bank_provider
source: Select bank provider
id: Pilih provider bank

# label_bank_account
source: Bank Account
id: Rekening Bank

# toast_location_permission
source: Location Permission
id: Izin Lokasi

# toast_using_default_location
source: Using default location. You can drag the marker to set your outlet location.
id: Menggunakan lokasi default. Anda dapat menyeret penanda untuk mengatur lokasi outlet Anda.

# dialog_location_permission_title
source: Location Permission
id: Izin Lokasi

# dialog_location_permission_message
source: We need access to your location to automatically set your outlet location on the map. This helps customers find your business easily. You can also manually set the location by dragging the marker.
id: Kami memerlukan akses ke lokasi Anda untuk mengatur lokasi outlet Anda secara otomatis di peta. Ini membantu pelanggan menemukan bisnis Anda dengan mudah. Anda juga dapat mengatur lokasi secara manual dengan menyeret penanda.
