Repository: zenta-dev/akademove
Catalog: apps/mobile/lib/l10n/arb/app_*.arb
Languages: id

source: Distance
id: Jarak

source: Fare
id: Tarif

source: No Show
id: Tidak Hadir

source: Popular merchants
id: Mitra populer

source: Choose the service that you want
id: Pilih layanan yang Anda inginkan

source: Pending Approval
id: Menunggu Persetujuan

source: Approved
id: Disetujui

source: Rejected
id: Ditolak

source: Suspended
id: Ditangguhkan

# app_version_information
source: App information and version
id: Informasi aplikasi dan versi

source: About
id: Tentang

source: Manage notification preferences
id: Kelola preferensi notifikasi

source: Notifications
id: Notifikasi

source: Driver preferences and settings
id: Preferensi dan pengaturan driver

source: Settings
id: Pengaturan

source: Save
id: Simpan

source: Profile updated successfully
id: Profil berhasil diperbarui

source: License plate cannot be empty
id: Plat nomor tidak boleh kosong

source: Enter license plate
id: Masukkan plat nomor

# update_your_license_plate
source: Update your license plate information
id: Perbarui informasi plat nomor Anda

source: Logged out successfully
id: Berhasil keluar

source: Are you sure you want to logout?
id: Apakah Anda yakin ingin keluar?

source: Logout
id: Keluar

source: Bank Account
id: Rekening Bank

source: Uploaded
id: Diunggah

source: Missing
id: Hilangan

# student_card
source: Student Card (KTM)
id: Kartu Mahasiswa (KTM)

# driver_license
source: Driver License (SIM)
id: SIM

# vehicle_certificate
source: Vehicle Certificate (STNK)
id: Sertifikat Kendaraan (STNK)

source: Taking Orders
id: Menerima Pesanan

source: Not Taking Orders
id: Tidak Menerima Pesanan

source: License Plate:
id: Nomor Kendaraan:

source: Failed to load profile
id: Gagal memuat profil

source: Retry
id: Coba Lagi

source: Close
id: Tutup

source: Chat with Customer
id: Chat dengan Pelanggan

source: Customer Phone Number
id: Nomor Telepon Pelanggan

source: No
id: Tidak

source: Yes, Cancel
id: Ya, Batalkan

# are_you_sure_you_want_to_cancel_this_order
source: Are you sure you want to cancel this order? The customer will be notified.
id: Apakah Anda yakin ingin membatalkan pesanan ini? Pelanggan akan diberitahu.

source: Cancel
id: Batal

# are_you_sure_you_want_to_reject_this_order
source: Are you sure you want to reject this order? This action cannot be undone.
id: Apakah Anda yakin ingin menolak pesanan ini? Tindakan ini tidak dapat dibatalkan.

source: Rate Customer
id: Beri Rating Pelanggan

source: Back to Home
id: Kembali ke Beranda

source: Complete Trip
id: Selesaikan Perjalanan

source: Start Trip
id: Mulai Perjalanan

source: Mark as Arrived
id: Tandai sebagai Tiba

source: Cancel Order
id: Batalkan Pesanan

source: Reject Order
id: Tolak Pesanan

source: Accept Order
id: Terima Pesanan

source: Customer phone number not available
id: Nomor telepon pelanggan tidak tersedia

source: Warning
id: Peringatan

source: Customer Info
id: Info Pelanggan

source: Service
id: Layanan

source: Cancelled by User
id: Dibatalkan oleh Pengguna

source: Cancelled by Driver
id: Dibatalkan oleh Driver

source: Cancelled by Merchant
id: Dibatalkan oleh Mitra

source: Cancelled by System
id: Dibatalkan oleh Sistem

source: Preparing Order
id: Mempersiapkan Pesanan

source: Finding Driver
id: Mencari Driver

source: Pickup Location
id: Lokasi Penjemputan

source: Dropoff Location
id: Lokasi Tujuan

source: Delete Schedule
id: Hapus Jadwal

# are_you_sure_you_want_to_delete_schedule
source: Are you sure you want to delete "{name}"? This action cannot be undone.
id: Apakah Anda yakin ingin menghapus "{name}"? Tindakan ini tidak dapat dibatalkan.

source: Sunday
id: Minggu

source: Monday
id: Senin

source: Tuesday
id: Selasa

source: Wednesday
id: Rabu

source: Thursday
id: Kamis

source: Friday
id: Jumat

source: Saturday
id: Sabtu

source: Update
id: Perbarui

source: Delete
id: Hapus

source: Add
id: Tambah

source: Failed to add schedule
id: Gagal menambahkan jadwal

source: Failed to update schedule
id: Gagal memperbarui jadwal

source: Schedule added successfully
id: Jadwal berhasil ditambahkan

source: Schedule updated successfully
id: Jadwal berhasil diperbarui

source: Please enter a schedule name
id: Tolong masukkan nama jadwal

source: Disable orders during this time
id: Nonaktifkan pesanan selama waktu ini

source: Repeat every week
id: Ulangi setiap minggu

source: Start Time
id: Waktu Mulai

source: End Time
id: Waktu Selesai

source: Day of Week
id: Hari dalam Seminggu

source: Schedule Name
id: Nama Jadwal

source: Recurring
id: Berulang

source: Add your class schedule to automatically disable order acceptance during class time
id: Tambahkan jadwal kuliah Anda untuk menonaktifkan penerimaan pesanan secara otomatis selama jam kuliah

# my_schedule
source: My Schedule (KRS)
id: Jadwal Saya (KRS)

source: No schedules found
id: Tidak ada jadwal ditemukan

source: No schedules yet
id: Belum ada jadwal

source: Schedule deleted successfully
id: Jadwal berhasil dihapus

source: Failed to delete schedule
id: Gagal menghapus jadwal

source: Manage Schedule
id: Kelola Jadwal

# leadeboard_and_badges
source: Leaderboard & Badges
id: Papan Peringkat & Lencana

source: Trips
id: Perjalanan

source: Ready to accept new orders
id: Siap menerima pesanan baru

source: Toggle on to start receiving orders
id: Aktifkan untuk mulai menerima pesanan

source: Requested
id: Dalam antrean

source: Matching
id: Mencocokkan

source: Preparing
id: Mempersiapkan

source: Ready for Pickup
id: Siap diambil

source: Accepted
id: Diterima

source: Arriving
id: Akan datang

source: In Trip
id: Sedang dalam perjalanan

source: Your completed and cancelled orders will appear here
id: Pesanan yang selesai dan dibatalkan akan muncul di sini

source: No orders found
id: Tidak ada pesanan ditemukan

source: All types
id: Semua Jenis

source: All
id: Semua

source: Completed
id: Selesai

source: In Progress
id: Dalam Proses

source: Cancelled
id: Dibatalkan

source: Failed to load orders
id: Gagal memuat pesanan

source: Top Up
id: Isi Ulang

source: Withdrawal
id: Penarikan

source: Payment
id: Pembayaran

source: Refund
id: Pengembalian Dana

source: Adjustment
id: Penyesuaian

source: Commission
id: Komisi

source: Earning
id: Penghasilan

source: Failed to withdraw
id: Gagal menarik dana

source: Withdraw
id: Tarik

source: Please enter withdrawal amount
id: Tolong masukkan jumlah penarikan

source: Please enter bank account number
id: Tolong masukkan nomor rekening bank

source: Insufficient balance
id: Saldo tidak mencukupi

# hint_account_name
source: Enter the account holder's name
id: Masukkan nama pemilik rekening bank

source: Optional
id: Opsional

source: Account Name
id: Nama Akun

# hint_bank_account_number
source: Enter your bank account number
id: Masukkan nomor rekening bank Anda

source: Withdraw Earnings
id: Tarik Penghasilan

source: No transactions yet
id: Belum ada transaksi

source: View All
id: Lihat Semua

source: Recent Transactions
id: Transaksi Terbaru

source: Net Earnings
id: Pendapatan Bersih

source: Total Earnings
id: Total Penghasilan

source: Total Income
id: Total Pemasukan

source: Total Expenses
id: Total Pengeluaran

source: Active
id: Aktif

source: Inactive
id: Tidak aktif

source: Available Balance
id: Saldo Tersedia

source: Earnings & wallet
id: Penghasilan & Dompet

source: Failed to load earnings
id: Gagal memuat penghasilan

source: Amount
id: Jumlah

source: Invalid amount
id: Jumlah tidak valid

# top_up_success
source: Top up successful
id: Top up berhasil

# hello
source: Hello, {name}
id: Halo, {name}

# qr_code_expired
source: The QR code has expired
id: Kode QR telah kedaluwarsa

source: Payment Expired
id: Pembayaran telah kedaluwarsa

source: Light Mode
id: Mode Terang

source: E-wallet
id: Dompet Digital

source: My Balance
id: Saldo Saya

source: Dark Mode
id: Mode Gelap

source: System Mode
id: Mode Sistem

source: Password
id: Kata Sandi

source: Forget Password?
id: Lupa Kata Sandi?

source: Sign In
id: Masuk

source: Loading...
id: Memuat...

source: Just a moment...
id: Tunggu sebentar...

# didnt_have_account
source: Don't have an account?
id: Belum punya akun?

source: Sign Up
id: Daftar

source: Let's Sign In to the AkadeMove!
id: Ayo Masuk ke AkadeMove!

source: Language
id: Bahasa

source: Theme
id: Tema

source: App Settings
id: Pengaturan Aplikasi

source: Account Settings
id: Pengaturan Akun

source: Terms of Service
id: Ketentuan Layanan

source: Privacy Policy
id: Kebijakan Privasi

source: FAQ
id: Pertanyaan

source: I agree to the
id: Saya setuju dengan

source: Terms and Conditions
id: Syarat dan Ketentuan

source: Change Password
id: Ganti Kata Sandi

source: Edit Profile
id: Sunting Profil

source: Sign Out
id: Keluar

source: Select your preferred language
id: Pilih bahasa yang Anda inginkan

source: Select your preferred theme
id: Pilih tema yang Anda inginkan

source: History
id: Riwayat

source: Home
id: Beranda

source: Profile
id: Profil

source: An error occurred
id: Terjadi kesalahan

# info
source: Information
id: Informasi

source: Success
id: Berhasil

source: Error
id: Kesalahan

source: Failed
id: Gagal

source: Your driver is
id: Driver Anda adalah

source: Origin
id: Asal

source: Destination
id: Tujuan

# special_instructions
source: Special Instructions (Optional)
id: Instruksi Khusus (Opsional)

# special_instructions_hint
source: e.g., 'Please handle with care', 'Call before delivery'
id: mis., 'Harap tangani dengan hati-hati', 'Telepon sebelum mengantarkan'

source: Delivery Service
id: Layanan Pengiriman

source: Back
id: Kembali

source: Next
id: Lanjut

source: Submit
id: Kirim

source: Save Changes
id: Simpan Perubahan

source: Allow
id: Izinkan

source: Open Settings
id: Buka Pengaturan

source: Send Reset Link
id: Kirim Kode OTP

source: Back to Sign In
id: Kembali ke Halaman Masuk

source: Reset Password
id: Atur Ulang Kata Sandi

source: Reject
id: Tolak

source: Accept
id: Terima

source: Grant Permission
id: Berikan Izin

source: Send Alert
id: Kirim Peringatan

source: Download QR
id: Unduh QR

source: Copy QR URL
id: Salin URL QR

source: Name
id: Nama

source: Phone
id: Telepon

source: Gender
id: Jenis Kelamin

source: Photo
id: Foto

source: Address
id: Alamat

source: Location
id: Lokasi

source: Unknown
id: Tidak Diketahui

# user_role
source: User
id: Pengguna

# merchant_role
source: Merchant
id: Mitra

source: Confirm Password
id: Konfirmasi Kata Sandi

# vehicle_registration
source: Vehicle Registration (STNK)
id: STNK

source: Bank Provider
id: Bank

source: Owner Name
id: Nama Pemilik

source: Outlet Name
id: Nama Outlet

source: Outlet Category
id: Kategori Outlet

source: Outlet Location
id: Lokasi Outlet

source: Government Document
id: Dokumen Identitas

source: Bank Account Number
id: Nomor Rekening Bank

# choose_service
source: Choose the service that you want
id: Pilih layanan yang Anda inginkan

source: Popular merchant
id: Mitra populer

source: Ride
id: Perjalanan

source: Delivery
id: Pengiriman

# voucher
source: My Voucher
id: Voucher Saya

source: Photo Profile
id: Foto Profil

source: Old Password
id: Kata Sandi Lama

source: New Password
id: Kata Sandi Baru

source: Confirm New Password
id: Konfirmasi Kata Sandi Baru

source: This month
id: Bulan ini

source: Expenses
id: Pengeluaran

source: Income
id: Pemasukan

# order_id
source: Order #
id: Pesanan #

source: Pickup
id: Penjemputan

source: Dropoff
id: Tujuan

source: Earnings
id: Penghasilan

source: Gender preference:
id: Preferensi gender:

source: Note:
id: Catatan:

# order_type_ride
source: Ride
id: Perjalanan

# order_type_delivery
source: Delivery
id: Pengiriman

# order_type_food
source: Food
id: Makanan

# note_pickup
source: Pickup:
id: Penjemputan:

# note_dropoff
source: Dropoff:
id: Tujuan:

# note_instructions
source: Instructions:
id: Instruksi:

# benefit_nearby_orders
source: Match you with nearby orders
id: Mencocokkan Anda dengan pesanan terdekat

# benefit_track_arrival
source: Let customers track your arrival
id: Pelanggan dapat melacak kedatangan Anda

# benefit_safety
source: Ensure safety and accountability
id: Memastikan keamanan dan akuntabilitas

source: Review Category
id: Kategori Ulasan

source: Cleanliness
id: Kebersihan

source: Courtesy
id: Kesopanan

source: Other
id: Lainnya

source: Comment (Optional)
id: Komentar (Opsional)

# select_type
source: Select emergency type:
id: Pilih jenis darurat:

source: Accident
id: Kecelakaan

source: Harassment
id: Pelecehan

source: Theft
id: Pencurian

# medical
source: Medical Emergency
id: Darurat Medis

source: Description:
id: Deskripsi:

source: Valid until
id: Berlaku sampai

source: Remaining Time :
id: Waktu Tersisa :

# atk
source: ATK (Stationery)
id: ATK (Alat Tulis Kantor)

source: Printing
id: Percetakan

# food
source: Food & Beverages
id: Makanan & Minuman

# drag_marker
source: Drag to adjust position
id: Geser untuk mengatur posisi

source: Step 1
id: Langkah 1

source: Step 2
id: Langkah 2

source: Step 3
id: Langkah 3

source: Step 4
id: Langkah 4

# hint_bank_provider
source: Pick your bank provider
id: Pilih bank

# hint_outlet_category
source: Select outlet category
id: Pilih kategori outlet

# hint_search_location
source: Search location (e.g., Monas Jakarta)
id: Cari lokasi (mis., Monas Jakarta)

# hint_share_experience
source: Share your experience...
id: Bagikan pengalaman Anda...

# hint_description
source: Describe the emergency situation...
id: Jelaskan situasi darurat...

# sign_up_choice
source: Start Your Journey with Us!
id: Mulai Perjalanan Anda Bersama Kami!

# driver_sign_up_step1
source: Tell us a bit about yourself to get started!
id: Ceritakan sedikit tentang diri Anda untuk memulai!

# driver_sign_up_step2
source: Upload your photo and documents to verify your account!
id: Unggah foto dan dokumen Anda untuk verifikasi akun!

# driver_sign_up_step3
source: Enter your vehicle details so we can set you up on the road!
id: Masukkan detail kendaraan Anda agar siap di jalan!

# driver_sign_up_step4
source: Add your bank account to receive your earnings securely!
id: Tambahkan rekening bank untuk menerima penghasilan Anda dengan aman!

# user_sign_up
source: Sign up now — your next ride or meal is just a tap away 🚴‍♂️🍔
id: Daftar sekarang — perjalanan atau makanan Anda hanya seketuk saja 🚴‍♂️🍔

# merchant_sign_up_step1
source: Tell us about yourself to kickstart your merchant journey!
id: Ceritakan tentang diri Anda untuk memulai perjalanan mitra!

# merchant_sign_up_step2
source: Share your outlet details and location so customers can find you easily!
id: Bagikan detail dan lokasi outlet agar pelanggan mudah menemukan Anda!

# merchant_sign_up_step3
source: Add your bank account to receive payments securely!
id: Tambahkan rekening bank untuk menerima pembayaran dengan aman!

source: Forgot Password
id: Lupa Kata Sandi

source: Driver Dashboard
id: Beranda Driver

source: Order History
id: Riwayat Pesanan

# merchant_edit_profile
source: Edit Profile
id: Sunting Profil

source: Set Up Outlet
id: Atur Outlet

source: Order Detail
id: Detail Pesanan

# menu_detail
source: Menu's Detail
id: Detail Menu

source: Sales Report
id: Laporan Penjualan

source: Commission Report
id: Laporan Komisi

# merchant_change_password
source: Change Password
id: Ganti Kata Sandi

source: Where you at?
id: Posisi Anda di mana?

# where_going
source: Where are you going?
id: Mau ke mana?

source: On Trip
id: Sedang Perjalanan

source: Trip Details
id: Detail Perjalanan

source: Create Menu
id: Buat Menu

source: Edit Menu
id: Sunting Menu

source: Sign Up Success
id: Pendaftaran Berhasil

source: Sign Up Failed
id: Pendaftaran Gagal

source: Location Permission
id: Izin Lokasi

source: Permission Denied
id: Izin Ditolak

# location_disabled
source: Location Services Disabled
id: Layanan Lokasi Dinonaktifkan

source: Location Permission Required
id: Izin Lokasi Diperlukan

source: Search Error
id: Kesalahan Pencarian

source: Location Found
id: Lokasi Ditemukan

source: Not Found
id: Tidak Ditemukan

source: Validation Error
id: Kesalahan Validasi

source: Oops...
id: Ups...

# new_order
source: New {type} Order
id: Pesanan {type} Baru

source: Order Unavailable
id: Pesanan Tidak Tersedia

source: Order Rejected
id: Pesanan Ditolak

# alert
source: Emergency Alert
id: Peringatan Darurat

source: Report Emergency
id: Laporkan Darurat

# confirm_logout
source: Logout
id: Keluar

source: Delete Menu
id: Hapus Menu

# description_user_role
source: Enjoy a comfortable and safe journey to your destination.
id: Nikmati perjalanan yang nyaman dan aman ke tujuan Anda.

# description_driver_role
source: Earn extra income by driving with us.
id: Dapatkan penghasilan tambahan dengan mengemudi bersama kami.

# description_merchant_role
source: Expand your business reach with our platform.
id: Perluas jangkauan bisnis Anda dengan platform kami.

# description_forgot_password
source: Enter your email to receive password reset instructions
id: Masukkan email Anda untuk menerima instruksi reset kata sandi

# unsupported_role_desc
source: This user role is not supported in the mobile app, please use web app
id: Role tidak didukung di aplikasi ini. Silakan gunakan aplikasi web untuk mengakses akun Anda.

# description_reset_password
source: Enter your new password
id: Masukkan kata sandi baru Anda

# helper_outlet_category
source: Select the main category for your outlet
id: Pilih kategori utama untuk outlet Anda

# helper_outlet_location
source: Search for a location, tap on map, or drag the marker
id: Cari lokasi, ketuk peta, atau geser penanda

# error_password_mismatch
source: Passwords do not match
id: Kata sandi tidak cocok

# error_file_required
source: File shouldn't be empty
id: File tidak boleh kosong

# error_photo_pick_failed
source: Failed to pick photo
id: Gagal memilih foto

# error_unknown
source: Unknown error
id: Kesalahan tidak diketahui

# error_unexpected
source: An unexpected error occurred
id: Terjadi kesalahan yang tidak terduga

# error_complete_required_fields
source: Please complete all required fields
id: Mohon lengkapi semua kolom yang wajib diisi

# error_fill_required_fields
source: Please fill all required fields
id: Mohon isi semua kolom yang wajib diisi

# error_location_search_empty
source: Please enter a location to search
id: Mohon masukkan lokasi untuk dicari

# error_location_not_found
source: Location not found. Please try a different search.
id: Lokasi tidak ditemukan. Silakan coba pencarian lain.

# error_location_search_failed
source: Unable to search location. Please check your internet connection.
id: Tidak dapat mencari lokasi. Mohon periksa koneksi internet Anda.

# error_address_unavailable
source: Unable to get address
id: Tidak dapat mendapatkan alamat

# error_invalid_reset_token
source: Invalid or missing reset token
id: Token reset tidak valid atau tidak ada

# error_description_required
source: Please provide a description
id: Mohon berikan deskripsi

# error_access_denied
source: Access denied. Please grant permission in settings.
id: Akses ditolak. Mohon berikan izin di pengaturan.

# error_storage_full
source: Not enough storage space.
id: Ruang penyimpanan tidak cukup.

# error_format_unsupported
source: Image format not supported.
id: Format gambar tidak didukung.

# error_unexpected_prefix
source: Unexpected error:
id: Kesalahan tak terduga:

# error_qr_save_failed
source: Failed to save QR code:
id: Gagal menyimpan kode QR:

# error_qr_copy_failed
source: Failed to copy QR URL:
id: Gagal menyalin URL QR:

# error_review_submit_failed
source: Failed to submit review
id: Gagal mengirim ulasan

# error_invalid_amount
source: Invalid amount
id: Jumlah tidak valid

# error_top_up_minimum
source: Top up amount atleast Rp 10,000
id: Jumlah isi ulang minimal Rp 10.000

# error_failed_to_estimate
source: Failed to estimate order
id: Gagal memperkirakan pesanan

# error_get_estimate_first
source: Please get estimate first
id: Mohon dapatkan perkiraan terlebih dahulu

# error_fill_all_fields
source: Please fill all required fields correctly
id: Mohon isi semua kolom dengan benar

# error_enter_bank_account
source: Please enter bank account number
id: Mohon masukkan nomor rekening bank

# error_select_bank_first
source: Please select a bank provider first
id: Mohon pilih bank terlebih dahulu

# success_sign_in
source: Successfully signed in
id: Masuk berhasil

# success_sign_up
source: Successfully signed up
id: Pendaftaran berhasil

# success_location_found
source: Marker moved to searched location
id: Penanda dipindahkan ke lokasi yang dicari

# success_review_submitted
source: Review submitted successfully
id: Ulasan berhasil dikirim

# success_qr_saved
source: QR code saved successfully
id: Kode QR berhasil disimpan

# success_qr_url_copied
source: QR URL copied to clipboard
id: URL QR disalin ke clipboard

# success_menu_updated
source: Menu updated successfully
id: Menu berhasil diperbarui

# success_bank_verified
source: Bank account verified successfully
id: Rekening bank berhasil diverifikasi

# message_remember_password
source: Remember your password?
id: Ingat kata sandi Anda?

# message_location_default
source: Using default location. You can drag the marker to set your outlet location.
id: Menggunakan lokasi default. Anda dapat menggeser penanda untuk mengatur lokasi outlet Anda.

# message_leocation_permission_required
source: Location permission is required to set your outlet location automatically.
id: Izin lokasi diperlukan untuk mengatur lokasi outlet Anda secara otomatis.

# message_location_permission_explanation
source: We need access to your location to automatically set your outlet location on the map. This helps customers find your business easily. You can also manually set the location by dragging the marker.
id: Kami memerlukan akses ke lokasi Anda untuk mengatur lokasi outlet Anda di peta secara otomatis. Ini membantu pelanggan menemukan bisnis Anda dengan mudah. Anda juga dapat mengatur lokasi secara manual dengan menggeser penanda.

# message_location_services_disabled
source: Location services are currently disabled on your device. Please enable them to automatically detect your outlet location.
id: Layanan lokasi saat ini dinonaktifkan di perangkat Anda. Mohon aktifkan untuk mendeteksi lokasi outlet Anda secara otomatis.

# message_location_permission_denied_forever
source: Location permission has been permanently denied. To use automatic location detection, please enable it in your app settings. You can still manually set your outlet location by dragging the marker on the map.
id: Izin lokasi telah ditolak secara permanen. Untuk menggunakan deteksi lokasi otomatis, mohon aktifkan di pengaturan aplikasi. Anda masih dapat mengatur lokasi outlet Anda secara manual dengan menggeser penanda di peta.

# message_order_unavailable
source: This order was cancelled or accepted by another driver
id: Pesanan ini dibatalkan atau diterima oleh driver lain

# message_order_rejected
source: You rejected the order
id: Anda menolak pesanan

# message_location_permission_denied_permanent
source: Location permission was previously denied. To go online and accept orders, you need to enable location access in your device settings.
id: Izin lokasi sebelumnya ditolak. Untuk online dan menerima pesanan, Anda perlu mengaktifkan akses lokasi di pengaturan perangkat.

# message_location_permission_explanation_driver
source: To accept ride and delivery orders, drivers must share their location in real-time. This helps:
id: Untuk menerima pesanan perjalanan dan pengiriman, driver harus membagikan lokasi mereka secara real-time. Ini membantu:

# message_redirect_settings
source: You will be redirected to app settings to enable location access.
id: Anda akan diarahkan ke pengaturan aplikasi untuk mengaktifkan akses lokasi.
